app/views/responses/show.html.erb

SELECT `answers`.* FROM `answers` WHERE `answers`.`response_id` = 2
---
	</tr>
	<%  @response.answers.each do  |r| %>