app/controllers/enquetes_controller.rb

SELECT `enquetes`.* FROM `enquetes`
---
	def index
    @surveys = Enquete.all()

SELECT `enquetes`.* FROM `enquetes` WHERE `enquetes`.`id` = 2 LIMIT 1
---
  def show
    @survey = Enquete.find(params[:id])

SELECT `enquetes`.* FROM `enquetes` WHERE `enquetes`.`id` = 2 LIMIT 1
---
  def edit
    @survey = Enquete.find(params[:id])

INSERT INTO `enquetes` (`created_at`, `description`, `end_date`, `published`, `start_date`, `title`, `updated_at`) VALUES ('2013-09-15 01:01:51', 'this is a trial survey to check the app', NULL, 1, NULL, 'Trial Survey', '2013-09-15 01:01:51')
---
  def create
    @questions = Question.types
    @survey = Enquete.new(params[:enquete])
    respond_to do |format|
      if @survey.save

SELECT `enquetes`.* FROM `enquetes` WHERE `enquetes`.`id` = 2 LIMIT 1
---
  def update
    @questions = Question.types
    @survey = Enquete.find(params[:id])