app/controllers/responses_controller.rb

  def index
    @responses = Response.all
---
SELECT `responses`.* FROM `responses`

  def new
    # raise params.inspect
    @survey = Enquete.find_by_id(params[:enquete_id])
    @response = Response.find_by_enquete_id_and_user_id(@survey.id, current_user.id)
    if @response
      # puts 2323333333333333333
      flash[:notice] = "Survey answered! Please choose another survey."
      redirect_to enquete_response_path(@survey, @response)
    else
      @response = @survey.responses.build
        # raise @survey.questions.size.inspect
      @survey.questions.size.times {@response.answers.build}
---
SELECT `enquetes`.* FROM `enquetes` WHERE `enquetes`.`id` IS NULL LIMIT 1
SELECT `responses`.* FROM `responses` WHERE `responses`.`enquete_id` = 1 AND `responses`.`user_id` = 1 LIMIT 1
SELECT COUNT(*) FROM `questions` WHERE `questions`.`enquete_id` = 1
SELECT `questions`.* FROM `questions` WHERE `questions`.`enquete_id` = 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def create
  	@survey = Enquete.find_by_id(params[:enquete_id])
    @response = Response.new(params[:response])
    @response.user = current_user
    if @response.save
---
SELECT `enquetes`.* FROM `enquetes` WHERE `enquetes`.`id` = 2 LIMIT 1
INSERT INTO `responses` (`created_at`, `enquete_id`, `updated_at`, `user_id`) VALUES ('2013-09-15 11:09:44', 2, '2013-09-15 11:09:44', 1)

  def show
    @response = Response.find_by_id(params[:id])
---
SELECT `responses`.* FROM `responses` WHERE `responses`.`id` = 2 LIMIT 1