app/controllers/users_controller.rb

	def create
	  @user = User.new(params[:user])
	  # raise @user.inspect
	  if @user.save
---
INSERT INTO `users` (`admin`, `created_at`, `email`, `password_hash`, `password_salt`, `registration_token`, `updated_at`, `verified`) VALUES (NULL, '2013-09-15 11:25:06', 'abc@abc.com', '$2a$10$h9X6SWqNJZGJUxpiA.QKPuA2evfMDwRWGaOT4lxtt4N9Rx2K7m3iu', '$2a$10$h9X6SWqNJZGJUxpiA.QKPu', 'Dhr9MFv7OIVw7QcVtZxGCVat4QM', '2013-09-15 11:25:06', NULL)