app/views/enquetes/show.html.erb

    <table>
     <% question.answers.each do |answer| %>
---
SELECT `answers`.* FROM `answers` WHERE `answers`.`question_id` = 19