app/views/enquetes/show.html.erb

SELECT COUNT(*) FROM `questions` WHERE `questions`.`enquete_id` = 2
SELECT `questions`.* FROM `questions` WHERE `questions`.`enquete_id` = 1
---

<% if @survey.questions.size > 0  %>

SELECT `responses`.* FROM `responses` WHERE `responses`.`enquete_id` = 2
---
  </tr>
  <% @survey.responses.each do |response| %>

SELECT `answers`.* FROM `answers` WHERE `answers`.`response_id` = 1
---
      <td><%#= raise response.user.email.split'@'[0].inspect %></td>
      <% response.answers.each do |answer| %>